#+TITLE: CSS for Org-exported HTML
#+SUBTITLE: A Clean and Comfort Stylesheet

#+HTML_HEAD: <link id="pagestyle" rel="stylesheet" type="text/css" href="org.css"/>
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t

#+MACRO: kbd @@html:<kbd>$1</kbd>@@

#+BEGIN_HTML
<script>
function swapStyle(css){
    document.getElementById('pagestyle').setAttribute('href', css);
}
</script>
<button onclick="swapStyle('org.css')">Customized</button>
<button onclick="swapStyle('org-default.css')">Default</button>
#+END_HTML

#+BEGIN_abstract
This article serves as a complete demonstration for my [[http:./org.css][org.css]], a
simple and clean stylesheet for org-exported HTML file.  You may
switch between the default style provided by Emacs Orgmode, i.e.,
styles specified in the variable =org-html-style-default= and my
customized stylesheet using the button at the top left corner.
#+END_abstract

#+TOC: headlines 2

*** Table

    #+CAPTION: Table Caption
    | N | N^2 | N^3 | N^4 | ~sqrt(n)~ | ~sqrt[4](N)~ |
    |---+-----+-----+-----+-----------+--------------|
    | 1 |   1 |   1 |   1 |         1 |            1 |
    | 2 |   4 |   8 |  16 |    1.4142 |       1.1892 |
    | 3 |   9 |  27 |  81 |    1.7321 |       1.3161 |
    |---+-----+-----+-----+-----------+--------------|
    #+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))

